# PANDAS - DAY 3 ( TIPS AND TRICKS )

## Table of Contents:

[1. how-to-find-the-version](#01--how-to-find-the-version)\
[2. making-a-data-frame](#02--making-a-data-frame)\
[3. using-numpy-to-create-dataframe](#3--using-numpy-to-create-dataframe)\
[4. sing-template-data](#4-using-template-data)\
[5. using-your-own-data](#5-using-your-own-data)\
[6. reverse-row-order](#6-reverse-row-order)\
[7. reverse-colun-order](#7--reverse-colun-order)\
[8. select-a-cloumn-by-a-data-type](#8--select-a-cloumn-by-a-data-type)\
[9. convert-numbers-into-strings](#9--convert-numbers-into-strings)\
[10. reduce-dataframe-size](#10--reduce-dataframe-size)\
[11. copy-data-from-clipboard](#11--copy-data-from-clipboard)\
[12. split-data-sets-in-two-frames](#12---split-data-sets-in-two-frames)

### 01 . How to find the version?

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.5.3'

In [3]:
pd.show_versions()

c:\Users\Administrator\AppData\Local\Programs\Python\Python311\Lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

INSTALLED VERSIONS
------------------
commit           : 2e218d10984e9919f0296931d92ea851c6a6faf5
python           : 3.11.1.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22000
machine          : AMD64
processor        : Intel64 Family 6 Model 78 Stepping 3, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.5.3
numpy            : 1.24.2
pytz             : 2022.7.1
dateutil         : 2.8.2
setuptools       : 65.5.0
pip              : 23.1.2
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.13.2
pandas_datareader: None
bs4              : 4.11.2
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.7.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.1.2
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : None

### 02- Making a Data Frame

In [4]:
df=pd.DataFrame({'Name ':["Uzair","Abbas","Lahad","Razi","Bilal"],'Age ': [20,19,21,22,19]})

In [5]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [6]:
df.head()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [7]:
df.tail()

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

In [8]:
df

   Name   Age
0  Uzair    20
1  Abbas    19
2  Lahad    21
3   Razi    22
4  Bilal    19

# 3- using numpy to create dataframe

In [9]:
# numpy array to create dataframe
import numpy as np
arr=np.array([['Uzair',20],['Abbas',19],['Lahad',21],['Razi',22],['Bilal',19]])
# arr
df=pd.DataFrame(arr,columns=['Name','Age'])
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [10]:
# numpy array data frame
pd.DataFrame(np.random.rand(5,2))
pd.DataFrame(np.random.rand(5,2), columns=list("AB"))

          A         B
0  0.430239  0.272615
1  0.221251  0.246594
2  0.408382  0.907510
3  0.568026  0.785103
4  0.167971  0.255579

In [11]:
pd.DataFrame(np.random.rand(50,20))

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,0.318380,0.381354,0.367135,0.875708,0.558936,0.544344,0.820230,0.366449,0.637887,0.076067,0.320244,0.347403,0.084431,0.652379,0.050093,0.146041,0.470892,0.633653,0.955252,0.347931
1,0.315274,0.627314,0.749543,0.590863,0.796734,0.725790,0.595876,0.832653,0.511864,0.811036,0.677421,0.304447,0.756351,0.526691,0.541092,0.166906,0.244303,0.782729,0.300934,0.732338
2,0.944821,0.691017,0.089841,0.122710,0.942495,0.008643,0.839771,0.384016,0.610950,0.829343,0.083730,0.659343,0.707690,0.571560,0.279818,0.608282,0.003905,0.752354,0.475678,0.448069
3,0.743248,0.778435,0.634361,0.768412,0.896794,0.885470,0.029188,0.829546,0.733586,0.042046,0.391303,0.798861,0.270778,0.212182,0.709914,0.774957,0.961160,0.427343,0.990900,0.071060
4,0.122925,0.859556,0.633660,0.903139,0.460621,0.137279,0.240580,0.754907,0.646299,0.481102,0.372587,0.133677,0.363231,0.094074,0.446933,0.439176,0.444189,0.768079,0.359377,0.659482
5,0.362624,0.138265,0.344089,0.846450,0.130706,0.385155,0.572201,0.643992,0.085187,0.742079,0.142379,0.687811,0.757192,0.627684,0.607546,0.167717,0.100678,0.124123,0.257215,0.747474
6,0.601958,0.578406,0.707006,0.906319,0.144756,0.348441,0.707360,0.828407,0.047705,0.977866,0.281170,0.783980,0.289381,0.299342,0.689576,0.263709,0.445331,0.788038,0.166874,0.492763
7,0.360873,0.082216,0.589390,0.727967,0.936905,0.692187,0.133716,0.974203,0.063852,0.206477,0.921060,0.030667,0.616490,0.970149,0.063360,0.641901,0.248366,0.042448,0.502775,0.763988
8,0.952027,0.746696,0.225652,0.077662,0.604306,0.796546,0.093721,0.368088,0.701476,0.405116,0.508922,0.449764,0.195548,0.894124,0.542825,0.110996,0.219330,0.559369,0.662768,0.431211
9,0.507547,0.636569,0.237044,0.141456,0.511373,0.636767,0.067291,0.950561,0.042368,0.593380,0.499813,0.819884,0.206841,0.740038,0.121426,0.228920,0.652099,0.875397,0.491526,0.153968
10,0.311634,0.319582,0.286958,0.568714,0.849338,0.876376,0.692156,0.799229,0.912131,0.992015,0.687423,0.097511,0.961979,0.678320,0.967376,0.944490,0.172409,0.908945,0.557247,0.288811
11,0.060038,0.655032,0.390242,0.993236,0.522536,0.527457,0.138514,0.706360,0.438939,0.980771,0.177608,0.626355,0.756612,0.863963,0.603453,0.618715,0.112646,0.394122,0.729104,0.017794
12,0.061869,0.534592,0.212684,0.571800,0.843601,0.682403,0.825139,0.578340,0.371918,0.801601,0.232645,0.519827,0.753976,0.543561,0.246340,0.390399,0.977654,0.428893,0.554714,0.714039
13,0.252363,0.220510,0.382373,0.453701,0.042919,0.569948,0.461147,0.115821,0.472201,0.389769,0.789688,0.370426,0.130344,0.970554,0.371904,0.973763,0.511743,0.922524,0.383196,0.685229
14,0.149821,0.963088,0.012556,0.869229,0.907857,0.633219,0.912512,0.301433,0.022913,0.220553,0.382890,0.529310,0.221227,0.142357,0.608352,0.833932,0.687204,0.449965,0.800484,0.120896
15,0.409280,0.368564,0.818748,0.229382,0.643130,0.410832,0.899423,0.575024,0.533942,0.002932,0.389710,0.099469,0.698069,0.611540,0.452043,0.471533,0.039867,0.090906,0.389636,0.509243
16,0.722770,0.981075,0.718749,0.675374,0.298982,0.435462,0.656239,0.018179,0.120963,0.710575,0.279534,0.944001,0.639782,0.119120,0.084702,0.042620,0.563599,0.778167,0.363612,0.704810
17,0.943449,0.619840,0.484940,0.350911,0.118452,0.481466,0.317765,0.759086,0.149118,0.086021,0.283340,0.683192,0.405640,0.701480,0.993594,0.457334,0.584275,0.127511,0.874998,0.796578
18,0.344040,0.592443,0.079220,0.974128,0.588412,0.818206,0.931893,0.421157,0.719466,0.227591,0.375891,0.374396,0.748857,0.211965,0.449352,0.282377,0.928826,0.962174,0.482544,0.649010
19,0.151631,0.371881,0.805197,0.003313,0.722133,0.859215,0.659667,0.013763,0.291295,0.468761,0.911626,0.136592,0.444196,0.149132,0.740565,0.886612,0.873783,0.642181,0.620428,0.285291
20,0.245731,0.066574,0.713126,0.672468,0.394938,0.701049,0.541436,0.383631,0.155393,0.168244,0.941245,0.929757,0.455565,0.116375,0.467205,0.554589,0.817381,0.839408,0.675025,0.041890
21,0.796771,0.946945,0.702999,0.203630,0.049876,0.325416,0.846532,0.818515,0.767779,0.417141,0.016949,0.360010,0.116484,0.603481,0.066931,0.598939,0.083219,0.821858,0.399593,0.895239
22,0.161006,0.354666,0.437612,0.936650,0.177745,0.411121,0.907673,0.876262,0.842676,0.202304,0.641121,0.813766,0.428587,0.836610,0.637347,0.785205,0.687582,0.406772,0.278142,0.390877
23,0.584230,0.391239,0.287600,0.470809,0.197180,0.721147,0.300309,0.357054,0.513288,0.646104,0.621353,0.281180,0.428414,0.322023,0.279695,0.775082,0.994417,0.531803,0.882710,0.026439
24,0.850402,0.260245,0.742786,0.300959,0.419875,0.038774,0.440991,0.083196,0.080312,0.134890,0.843524,0.196181,0.135357,0.647763,0.883920,0.408926,0.596152,0.033591,0.624215,0.912925
25,0.073923,0.251585,0.045803,0.436249,0.235996,0.839148,0.629909,0.219945,0.880279,0.004981,0.302584,0.188387,0.405692,0.558395,0.812324,0.834301,0.764357,0.830565,0.940184,0.811173
26,0.078614,0.746236,0.406246,0.678828,0.846589,0.125207,0.729185,0.554260,0.837213,0.139808,0.225034,0.030147,0.512233,0.473986,0.955322,0.460162,0.850094,0.902350,0.837670,0.934715
27,0.615017,0.820881,0.740379,0.681838,0.058918,0.230918,0.198919,0.069361,0.556641,0.311425,0.388790,0.915485,0.152841,0.755657,0.276066,0.038755,0.264388,0.016823,0.175780,0.721090
28,0.312148,0.348935,0.608437,0.708063,0.169273,0.682132,0.682955,0.424236,0.485619,0.154063,0.652271,0.212348,0.183051,0.845647,0.376684,0.912258,0.842550,0.098349,0.663383,0.661544
29,0.546432,0.131121,0.976436,0.003699,0.899140,0.322980,0.464435,0.524034,0.997835,0.669970,0.249053,0.019023,0.061057,0.558731,0.503131,0.198358,0.643716,0.151712,0.726391,0.692070
30,0.784410,0.690411,0.357834,0.377873,0.102044,0.666129,0.144903,0.354944,0.248877,0.453990,0.976070,0.058848,0.534747,0.478596,0.577192,0.806290,0.057576,0.903399,0.926192,0.432370
31,0.368089,0.841217,0.794944,0.821795,0.403306,0.429980,0.805922,0.322512,0.101074,0.855252,0.234463,0.548140,0.385620,0.477785,0.279290,0.708148,0.706507,0.194709,0.919845,0.223934
32,0.617622,0.603861,0.813017,0.696283,0.946065,0.640379,0.962499,0.419384,0.980193,0.540183,0.464080,0.235490,0.162585,0.461242,0.179566,0.013273,0.094411,0.674931,0.925693,0.611343
33,0.597516,0.667732,0.568809,0.908860,0.519883,0.643738,0.979455,0.157283,0.823105,0.123369,0.678015,0.815748,0.288000,0.367660,0.570897,0.678987,0.937469,0.128099,0.376820,0.663406
34,0.705662,0.506129,0.226325,0.839640,0.010169,0.087644,0.755751,0.717446,0.085216,0.441262,0.055763,0.611094,0.533950,0.433965,0.897385,0.140684,0.846367,0.845947,0.636993,0.625543
35,0.035120,0.724881,0.905444,0.727851,0.043522,0.179990,0.395293,0.687960,0.017716,0.116588,0.620837,0.961401,0.457147,0.819471,0.295441,0.431048,0.966890,0.501169,0.456292,0.872701
36,0.897827,0.086513,0.050717,0.249458,0.295536,0.599817,0.550225,0.775295,0.496253,0.580686,0.751585,0.284347,0.099478,0.646287,0.006029,0.664088,0.067810,0.234649,0.388211,0.912266
37,0.806946,0.740033,0.067005,0.683472,0.126737,0.973316,0.265769,0.724755,0.338664,0.981857,0.369739,0.446826,0.505637,0.128216,0.741356,0.727099,0.858683,0.531875,0.595414,0.355001
38,0.704742,0.693199,0.480648,0.640707,0.101911,0.214153,0.433513,0.347172,0.647428,0.661128,0.147519,0.846588,0.008129,0.136663,0.896598,0.472239,0.771463,0.182060,0.014427,0.050464
39,0.093086,0.878972,0.622167,0.002780,0.400785,0.035190,0.806502,0.372629,0.824381,0.405189,0.295284,0.661326,0.217521,0.936396,0.022328,0.831788,0.685838,0.308307,0.955346,0.932660
40,0.410149,0.280741,0.280461,0.022886,0.122996,0.729721,0.975669,0.359937,0.004887,0.258513,0.814558,0.916908,0.996540,0.091305,0.824905,0.380255,0.553970,0.821586,0.826217,0.815105
41,0.965067,0.628217,0.406175,0.986713,0.379818,0.332579,0.051157,0.865853,0.618424,0.870265,0.844797,0.756796,0.432125,0.496464,0.378134,0.113525,0.305595,0.802834,0.297573,0.849530
42,0.067920,0.823402,0.748116,0.556928,0.120213,0.575162,0.409179,0.149120,0.939356,0.634015,0.502696,0.508826,0.090206,0.211746,0.488541,0.235248,0.024427,0.384044,0.273121,0.039140
43,0.011490,0.386809,0.713508,0.122265,0.156276,0.611068,0.679635,0.744880,0.327596,0.380403,0.936105,0.406223,0.554563,0.542712,0.423144,0.062889,0.536294,0.337181,0.435960,0.265543
44,0.446905,0.647561,0.367741,0.392353,0.730447,0.649286,0.781991,0.366135,0.417398,0.863634,0.856466,0.956060,0.415554,0.866656,0.212848,0.462630,0.785350,0.726051,0.348530,0.145247
45,0.233605,0.497245,0.752896,0.068747,0.838674,0.335899,0.044703,0.057693,0.145538,0.339301,0.489276,0.692860,0.321729,0.649617,0.721582,0.038870,0.557563,0.900733,0.577185,0.579911
46,0.088809,0.698528,0.706074,0.291903,0.634104,0.040214,0.598682,0.171998,0.423022,0.861515,0.875077,0.531095,0.755092,0.174627,0.782349,0.110415,0.516650,0.407983,0.104447,0.645093
47,0.453287,0.844106,0.633369,0.251318,0.221785,0.246761,0.054664,0.519939,0.215580,0.002873,0.490668,0.839729,0.351959,0.466363,0.068866,0.795666,0.612242,0.863686,0.719758,0.607419
48,0.821108,0.606805,0.308031,0.884355,0.643161,0.811530,0.730187,0.199892,0.316355,0.539963,0.904329,0.145133,0.252827,0.587908,0.517146,0.761728,0.940727,0.260352,0.767936,0.492814
49,0.507047,0.787735,0.907810,0.280286,0.482663,0.212690,0.611235,0.623301,0.377440,0.753629,0.767014,0.649250,0.785153,0.471797,0.619200,0.297641,0.505683,0.202433,0.688570,0.631002

In [12]:
df

    Name Age
0  Uzair  20
1  Abbas  19
2  Lahad  21
3   Razi  22
4  Bilal  19

In [13]:
# how to rename column names
df=pd.DataFrame({'A col ':[1,2,3,4,5],'B col ': [20,19,18,17,16]})

In [14]:
df.rename(columns={'A col': 'a col','B col':'b col'}, inplace=True)

In [15]:
df

   A col   B col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [16]:
df.columns=['aa_col','bb_col']

In [17]:
df

   aa_col  bb_col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [18]:
# to replace any character, string, lateral
df.columns=df.columns.str.replace('_',' ')

In [19]:
df

   aa col  bb col
0       1      20
1       2      19
2       3      18
3       4      17
4       5      16

In [20]:
# adding prefix
df.add_prefix('UHS_')

   UHS_aa col  UHS_bb col
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

In [21]:
# adding suffix
df.add_suffix('_UHS')

   aa col_UHS  bb col_UHS
0           1          20
1           2          19
2           3          18
3           4          17
4           5          16

# 4 using template data

In [22]:
import pandas as pd
import numpy as np
import seaborn as sns

kashti = sns.load_dataset('titanic')
kashti.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
#  summary
kashti.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [24]:
# cloumns names
kashti.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [25]:
# saving a template dataset

kashti.to_csv('kashti.csv')

In [26]:
# saving to excel
kashti.to_excel('kashti.xlsx')

In [27]:
# viewing csv file
kashti=pd.read_csv('kashti.csv')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [28]:
# reading excel file
kashti=pd.read_excel('kashti.xlsx')
kashti

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [29]:
# to text file
kashti.to_csv('kashti.txt',sep='\t')

In [30]:
#  reading text file
kashti=pd.read_csv('kashti.txt',sep='\t')
kashti

,Unnamed: 0.1,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

# 5 using your own data

In [31]:
import pandas as pd
df = pd.read_csv('database.csv')
df

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.2460,145.6160,Earthquake,131.60,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.8630,127.3520,Earthquake,80.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.5790,-173.9720,Earthquake,20.00,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.0760,-23.5570,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.9380,126.4270,Earthquake,15.00,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23407,12/28/2016,08:22:12,38.3917,-118.8941,Earthquake,12.30,1.2,40.0,5.6,ML,...,18.0,42.47,0.120,NaN,0.1898,NN00570710,NN,NN,NN,Reviewed
23408,12/28/2016,09:13:47,38.3777,-118.8957,Earthquake,8.80,2.0,33.0,5.5,ML,...,18.0,48.58,0.129,NaN,0.2187,NN00570744,NN,NN,NN,Reviewed
23409,12/28/2016,12:38:51,36.9179,140.4262,Earthquake,10.00,1.8,NaN,5.9,MWW,...,NaN,91.00,0.992,4.8,1.5200,US10007NAF,US,US,US,Reviewed
23410,12/29/2016,22:30:19,-9.0283,118.6639,Earthquake,79.00,1.8,NaN,6.3,MWW,...,NaN,26.00,3.553,6.0,1.4300,US10007NL0,US,US,US,Reviewed
23411,12/30/2016,20:08:28,37.3973,141.4103,Earthquake,11.94,2.2,NaN,5.5,MB,...,428.0,97.00,0.681,4.5,0.9100,US10007NTD,US,US,US,Reviewed

In [32]:
df.head()

,Date,Time,Latitude,Longitude,Type,Depth,Depth Error,Depth Seismic Stations,Magnitude,Magnitude Type,...,Magnitude Seismic Stations,Azimuthal Gap,Horizontal Distance,Horizontal Error,Root Mean Square,ID,Source,Location Source,Magnitude Source,Status
0,01/02/1965,13:44:18,19.246,145.616,Earthquake,131.6,NaN,NaN,6.0,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860706,ISCGEM,ISCGEM,ISCGEM,Automatic
1,01/04/1965,11:29:49,1.863,127.352,Earthquake,80.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860737,ISCGEM,ISCGEM,ISCGEM,Automatic
2,01/05/1965,18:05:58,-20.579,-173.972,Earthquake,20.0,NaN,NaN,6.2,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860762,ISCGEM,ISCGEM,ISCGEM,Automatic
3,01/08/1965,18:49:43,-59.076,-23.557,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860856,ISCGEM,ISCGEM,ISCGEM,Automatic
4,01/09/1965,13:32:50,11.938,126.427,Earthquake,15.0,NaN,NaN,5.8,MW,...,NaN,NaN,NaN,NaN,NaN,ISCGEM860890,ISCGEM,ISCGEM,ISCGEM,Automatic

# 6 reverse row order

In [33]:
import pandas as pd
import seaborn as sns

df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [34]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [35]:
# to check in descending order
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [36]:
df.loc[::-1].reset_index(drop=True).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# 7- reverse colun order

In [37]:
df.loc[:,::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

# 8- select a cloumn by a data type

In [38]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [39]:
# only select those having numeric datatype

df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [40]:
#  those with float
df.select_dtypes(include=['float']).head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [41]:
#  those with object
df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [42]:
#  those with multiple datatypes
df.select_dtypes(include=['float','number','object']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,man,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,woman,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,woman,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,woman,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,man,Southampton,no

In [43]:
df.select_dtypes(exclude=['number']).head()

      sex embarked  class    who  adult_male deck  embark_town alive  alone
0    male        S  Third    man        True  NaN  Southampton    no  False
1  female        C  First  woman       False    C    Cherbourg   yes  False
2  female        S  Third  woman       False  NaN  Southampton   yes   True
3  female        S  First  woman       False    C  Southampton   yes  False
4    male        S  Third    man        True  NaN  Southampton    no   True

# 9- convert numbers into strings

In [44]:
# creating a dataframe
df = pd.DataFrame({'col a' : ['1','2','3','4','5'],
                   'col b':['6','7','8','9','10']})
df

  col a col b
0     1     6
1     2     7
2     3     8
3     4     9
4     5    10

In [45]:
df.dtypes

col a    object
col b    object
dtype: object

In [46]:
# changing datatype to numeric
pd.to_numeric(df['col a'],errors='coerce')
df.dtypes

col a    object
col b    object
dtype: object

In [47]:
#  changing type object to int
df=df.astype({'col a':'int','col b':'object'})

In [48]:
df.dtypes

col a     int32
col b    object
dtype: object

In [49]:
# changing datatype to numeric
df=pd.to_numeric(df['col b'],errors='coerce')

# 10- reduce dataframe size

In [50]:
df=sns.load_dataset('titanic')

In [51]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [52]:
#  checking the memory usage by this dataset in our computer
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 313.7 KB

In [53]:
# reducing the size by taking a fraction of whole dataset
df.sample(frac=0.1).shape

(89, 15)

In [54]:
#  taking 0.5 fraction of whole dataset
df.sample(frac=0.5).shape

(446, 15)

# 11- copy data from clipboard

In [55]:
# dataset download
import seaborn as sns
import pandas as pd

df=sns.load_dataset('titanic')
df.to_excel('kashti.xlsx')

In [61]:
# read clipboard in python
df=pd.read_clipboard()
df

,3,male,20,0,0.1,8.05,S,Third,man,true,Unnamed: 10,Southampton,no,true.1
0,3,male,39.0,1,5,31.28,S,Third,man,True,NaN,Southampton,no,False
1,3,female,14.0,0,0,7.85,S,Third,child,False,NaN,Southampton,no,True
2,2,female,55.0,0,0,16.00,S,Second,woman,False,NaN,Southampton,yes,True
3,3,male,2.0,4,1,29.13,Q,Third,child,False,NaN,Queenstown,no,False
4,2,male,NaN,0,0,13.00,S,Second,man,True,NaN,Southampton,yes,True

# 12 - split data sets in two frames

In [56]:
# dataset download
import seaborn as sns
import pandas as pd

df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [57]:
len(df)

891

In [59]:
df.shape

(891, 15)

In [60]:
# we have one sample of data set
from random import random
kashti_1 = df.sample(frac=0.5,random_state=1)
kashti_1.shape

(446, 15)

In [62]:
#  then we just dropped taken dataset from whole dataset
kashti_2= df.drop(kashti_1.index)
kashti_2.shape

(445, 15)

In [63]:
kashti_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [64]:
kashti_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [65]:
df.shape

(891, 15)

In [66]:
len(kashti_1) + len(kashti_2)

891

# 13 - joining dataset into one dataframe

In [67]:
df1=kashti_1.append(kashti_2)
df1.shape

C:\Users\Administrator\AppData\Local\Temp\ipykernel_11080\805721718.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1=kashti_1.append(kashti_2)

(891, 15)

# 14 - filtering a data set

In [68]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True